## SQL - CASE WHEN Expressions [ Conditional Logic in SQL ]
    CASE WHEN is SQL’s way of writing conditional logic — similar to:
    - if–else in programming
    - switch–case in other languages
    It lets you apply conditions and return values based on those conditions.
    CASE WHEN Used to ::
    - Categorize data
    - Create new columns
    - Apply business rules
    - Perform conditional calculations

### Types of CASE Expressions
    1️⃣ Simple CASE
    Used when you compare one column against multiple values.
    
    2️⃣ Searched CASE
    Used when you evaluate multiple logical conditions (<, >, BETWEEN, AND, etc.)

### Database Connection

In [7]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:@localhost/test

In [9]:
%%sql
SELECT version();

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[('10.4.32-MariaDB',)]

### Using Already Created table employees

In [12]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (102, 'Neha', 'HR', 45000, 28, 'Mumbai', datetime.date(2021, 3, 15)),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (104, 'Sneha', 'Finance', 50000, 26, 'Delhi', datetime.date(2022, 11, 5)),
 (105, 'Vikas', 'HR', 40000, 35, 'Mumbai', datetime.date(2019, 8, 12)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

### Categories employees by salary

In [15]:
%%sql
select emp_name, salary,
           case
                when salary > 60000 then 'High'
                when salary > 40000 then 'Medium'
                else 'Low'
           end as salary_category
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Amit', 60000, 'Medium'),
 ('Neha', 45000, 'Medium'),
 ('Rahul', 75000, 'High'),
 ('Sneha', 50000, 'Medium'),
 ('Vikas', 40000, 'Low'),
 ('Priya', 85000, 'High'),
 ('Arjun', 65000, 'High')]

### Count number of employees with salary > 60k department wise

In [38]:
%%sql
select department,
       count(case when salary >= 60000 then 1 end) as high_paid_emp
from employees
group by department;

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[('Finance', 1), ('HR', 0), ('IT', 3)]

### Salary position in department

In [45]:
%%sql
select emp_name, department, salary,
        case 
             when salary > avg(salary) over(partition by department) then "Above Average"
             else "Below Average"
       end as salary_status
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Sneha', 'Finance', 50000, 'Below Average'),
 ('Arjun', 'Finance', 65000, 'Above Average'),
 ('Vikas', 'HR', 40000, 'Below Average'),
 ('Neha', 'HR', 45000, 'Above Average'),
 ('Amit', 'IT', 60000, 'Below Average'),
 ('Priya', 'IT', 85000, 'Above Average'),
 ('Rahul', 'IT', 75000, 'Above Average')]

### Department wise Top earner

In [52]:
%%sql
select emp_name, department, salary,
        case 
             when dense_rank() over(partition by department order by salary desc)= 1 then "Top Earner"
             else "Not"
       end as emp_position
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Arjun', 'Finance', 65000, 'Top Earner'),
 ('Sneha', 'Finance', 50000, 'Not'),
 ('Neha', 'HR', 45000, 'Top Earner'),
 ('Vikas', 'HR', 40000, 'Not'),
 ('Priya', 'IT', 85000, 'Top Earner'),
 ('Rahul', 'IT', 75000, 'Not'),
 ('Amit', 'IT', 60000, 'Not')]

### Mark employees as Top 10% earners per department

In [60]:
%%sql
select emp_name, department, salary,
        case 
             when percent_rank() over(partition by department order by salary desc) <= 0.1 then "Top 10%"
             else "Not"
       end as emp_position
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Arjun', 'Finance', 65000, 'Top 10%'),
 ('Sneha', 'Finance', 50000, 'Not'),
 ('Neha', 'HR', 45000, 'Top 10%'),
 ('Vikas', 'HR', 40000, 'Not'),
 ('Priya', 'IT', 85000, 'Top 10%'),
 ('Rahul', 'IT', 75000, 'Not'),
 ('Amit', 'IT', 60000, 'Not')]

### Label employees based on age :: 
    Young → age < 30
    Mid Age → age between 30 and 35
    Senior → age > 35

In [66]:
%%sql
select emp_name, age,
        case
             when age < 30 then "Young"
             when age between 30 and 35 then "Mid Age"
             else "Senior"
        end age_category
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Amit', 25, 'Young'),
 ('Neha', 28, 'Young'),
 ('Rahul', 30, 'Mid Age'),
 ('Sneha', 26, 'Young'),
 ('Vikas', 35, 'Mid Age'),
 ('Priya', 29, 'Young'),
 ('Arjun', 32, 'Mid Age')]

### Categorize employees by city :: 
    Metro → Mumbai, Delhi, Bangalore
    Non-Metro → all other cities

In [69]:
%%sql
select emp_name,  city,
        case
             when city = 'Mumbai' or city = "Delhi" or city = "Bangalore" then "Metro City"
             else "Non-Metro"
        end city_category
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Amit', 'Pune', 'Non-Metro'),
 ('Neha', 'Mumbai', 'Metro City'),
 ('Rahul', 'Pune', 'Non-Metro'),
 ('Sneha', 'Delhi', 'Metro City'),
 ('Vikas', 'Mumbai', 'Metro City'),
 ('Priya', 'Bangalore', 'Metro City'),
 ('Arjun', 'Pune', 'Non-Metro')]

### Count number of employees in each department who are :: 
    High Salary (salary ≥ 70000) 
    Low Salary (salary < 50000)

In [96]:
%%sql
select department,
           count(case when salary >= 70000 then 1 end) as High_salary,
           count(case when salary < 50000 then 1 end) as Low_salary

from employees
group by department;

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[('Finance', 0, 0), ('HR', 0, 2), ('IT', 2, 0)]

### Identify employees as ::
    Experienced → joined before 2020
    Moderate → joined between 2020 and 2021
    Fresher → joined after 2021

In [110]:
%%sql
select emp_name, joining_date,
        case 
             when joining_date < '2020-01-01' then 'Experienced' 
             when joining_date between '2020-01-01' and '2021-12-31' then 'Moderate'
             else "Fresher"
        end as emp_exp
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Amit', datetime.date(2022, 6, 10), 'Fresher'),
 ('Neha', datetime.date(2021, 3, 15), 'Moderate'),
 ('Rahul', datetime.date(2020, 1, 20), 'Moderate'),
 ('Sneha', datetime.date(2022, 11, 5), 'Fresher'),
 ('Vikas', datetime.date(2019, 8, 12), 'Experienced'),
 ('Priya', datetime.date(2018, 4, 25), 'Experienced'),
 ('Arjun', datetime.date(2020, 9, 18), 'Moderate')]

### Create a salary flag:
    1 if salary ≥ 60000
    0 otherwise

In [125]:
%%sql
select emp_name, salary,
        case 
             when salary >= 60000 then  '1'
             else '0'
        end as salary_flag
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Amit', 60000, '1'),
 ('Neha', 45000, '0'),
 ('Rahul', 75000, '1'),
 ('Sneha', 50000, '0'),
 ('Vikas', 40000, '0'),
 ('Priya', 85000, '1'),
 ('Arjun', 65000, '1')]

### Mark employees as:
    IT Premium → department = IT and salary ≥ 70000
    Normal → all others

In [128]:
%%sql
select emp_name, department, salary,
        case 
             when department = 'IT' and salary >= 70000 then 'IT Premium'
             else "Normal"
        end as Pre_emp
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Amit', 'IT', 60000, 'Normal'),
 ('Neha', 'HR', 45000, 'Normal'),
 ('Rahul', 'IT', 75000, 'IT Premium'),
 ('Sneha', 'Finance', 50000, 'Normal'),
 ('Vikas', 'HR', 40000, 'Normal'),
 ('Priya', 'IT', 85000, 'IT Premium'),
 ('Arjun', 'Finance', 65000, 'Normal')]

### Show department-wise average salary category:
    High Avg → avg salary ≥ 65000
    Medium Avg → avg salary between 50000–64999
    Low Avg → avg salary < 50000

In [181]:
%%sql
select emp_name, department, salary,
                    case 
                         when (avg(salary) over(partition by department))> 65000 then 'High Avg'
                         when (avg(salary) over(partition by department)) between 50000 and 64999 then 'Medium Avg'
                         else "Low Avg"
                    end as Dep_avg_salary
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Arjun', 'Finance', 65000, 'Medium Avg'),
 ('Sneha', 'Finance', 50000, 'Medium Avg'),
 ('Vikas', 'HR', 40000, 'Low Avg'),
 ('Neha', 'HR', 45000, 'Low Avg'),
 ('Priya', 'IT', 85000, 'High Avg'),
 ('Amit', 'IT', 60000, 'High Avg'),
 ('Rahul', 'IT', 75000, 'High Avg')]

### Identify employees whose salary is:
    Higher than previous employee
    Lower than previous employee
    Same as previous employee

In [190]:
%%sql
select emp_name, salary, joining_date,
            case 
                 when salary > lag(salary)  over(order by joining_date) then 'Higher'
                 when salary < lag(salary)  over(order by joining_date) then 'Lower'
                 else 'Same'
            end as iden_emp_sal
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Priya', 85000, datetime.date(2018, 4, 25), 'Same'),
 ('Vikas', 40000, datetime.date(2019, 8, 12), 'Lower'),
 ('Rahul', 75000, datetime.date(2020, 1, 20), 'Higher'),
 ('Arjun', 65000, datetime.date(2020, 9, 18), 'Lower'),
 ('Neha', 45000, datetime.date(2021, 3, 15), 'Lower'),
 ('Amit', 60000, datetime.date(2022, 6, 10), 'Higher'),
 ('Sneha', 50000, datetime.date(2022, 11, 5), 'Lower')]